#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
my_series = pd.Series([4, 8, 15, 16, 23, 42])
print(my_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# -------------------------------------------------

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
import random
import pandas as pd
lst = [random.randint(1,1000) for i in range(10)]
print(pd.Series(lst))

0    735
1    642
2    546
3    295
4     21
5    184
6    198
7    483
8    735
9    917
dtype: int64

# -------------------------------------------------

#### Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [3]:
my_dict = [
    {
        "Name":"Alice",
        "Age":25,
        "Gender":"Female"
    },
    {
        "Name":"Bob",
        "Age":30,
        "Gender":"Male"
    },
    {
        "Name":"Claire",
        "Age":27,
        "Gender":"Female"
    }
]

df = pd.DataFrame(my_dict)
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# ------------------------------------------------------

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

* In pandas, a DataFrame is a two-dimensional labeled data structure that can store data of different types in columns. It is similar to a spreadsheet or a SQL table, where data is organized in rows and columns. Each column in a DataFrame is a pandas Series object.

* The main difference between a pandas Series and a DataFrame is that a Series represents a single column of data, while a DataFrame can contain multiple columns of data. A DataFrame also has row labels, which can be used to access specific rows of data.
---
#### Example
    * Dataframe

In [4]:
my_dict = [
    {
        "Name":"Alice",
        "Age":25,
        "Gender":"Female"
    },
    {
        "Name":"Bob",
        "Age":30,
        "Gender":"Male"
    },
    {
        "Name":"Claire",
        "Age":27,
        "Gender":"Female"
    }
]

df = pd.DataFrame(my_dict)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Example
    * Series

In [5]:
print(type(df['Age']))
print(df['Age'])

<class 'pandas.core.series.Series'>
0    25
1    30
2    27
Name: Age, dtype: int64

# -------------------------------------------------

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

* Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some of the most commonly used functions:
    * head() and tail()
    * describe()
    * sort_values()
    * groupby()
    * drop()

* **sort_values():** This function is used to sort the DataFrame by one or more columns. It can sort the DataFrame in ascending or descending order.

In [6]:
## Example
df.sort_values('Age', ascending=True)

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

# ------------------------------------------------

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

* In pandas, both Series and DataFrame are mutable in nature, meaning that their values can be modified after they have been created.

* A Series is a one-dimensional labeled array that can hold data of any type. You can modify the values of a Series by assigning new values to specific indices.

* Similarly, a DataFrame is a two-dimensional labeled data structure that can hold data of different types in columns. You can modify the values of a DataFrame by assigning new values to specific cells or columns.

* A Panel, on the other hand, is a three-dimensional labeled data structure that can hold multiple DataFrames. While Panels can also be modified, they are less commonly used than Series and DataFrames, as many use cases can be handled with just one or two dimensions.

# --------------------------------------------------

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [7]:
import pandas as pd

names = pd.Series(['Madhan', 'Kumar', 'Elakiya', 'Priya', 'Sandhiya'])

ages = pd.Series([25, 30, 21, 18, 26])

cities = pd.Series(['Chennai', 'Chennai', 'Pune', 'Mumbai', 'Chennai'])

data = {'Name': names, 'Age': ages, 'City': cities}

df = pd.DataFrame(data)

df

       Name  Age     City
0    Madhan   25  Chennai
1     Kumar   30  Chennai
2   Elakiya   21     Pune
3     Priya   18   Mumbai
4  Sandhiya   26  Chennai